app/controllers/members_controller.rb

SELECT "members".* FROM "members" ORDER BY name DESC
---
  def index
    if params[:format] == nil or params[:format] == "None"
	  @selected = 0
      @members = Member.order("name ASC")

INSERT INTO "members" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "A Person"], ["email", "person@mail.com"], ["created_at", "2021-02-24 03:49:43.989321"], ["updated_at", "2021-02-24 03:49:43.989321"]]
---
  def create
    @member = Member.new(member_params)
    name = @member.name

    if @member.save

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def delete
    @member = Member.find(params[:id])