app/controllers/payments_controller.rb

  def index
    @payments = Payment.order("created_at DESC")
---
SELECT "payments".* FROM "payments" ORDER BY created_at DESC

  def new
    @payment = Payment.new
    @members = Member.order("name ASC")
    @semesters = Semester.order("start_date DESC")
    @officers = Officer.order("name ASC")
---
SELECT "members".* FROM "members" ORDER BY name ASC
SELECT "semesters".* FROM "semesters" ORDER BY start_date DESC
SELECT "officers".* FROM "officers" ORDER BY name ASC

  def create
    @payment = Payment.new(payment_params)
    @payment.paymentDate = DateTime.now

    # Make sure associated member, officer, and semester exist
    if valid_relations(@payment)
      if @payment.save
---
INSERT INTO "payments" ("paymentDate", "paymentAmount", "created_at", "updated_at", "member_id", "officer_id", "semester_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @payment = Payment.find(params[:id])
    @members = Member.order("name ASC")
    @semesters = Semester.order("start_date DESC")
    @officers = Officer.order("name ASC")
---
SELECT "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "members".* FROM "members" ORDER BY name ASC
SELECT "semesters".* FROM "semesters" ORDER BY start_date DESC
SELECT "officers".* FROM "officers" ORDER BY name ASC

  def update
    @payment = Payment.find(params[:id])
    if @payment.update(payment_params)
---
SELECT "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "payments" SET "updated_at" = $1, "member_id" = $2 WHERE "payments"."id" = $3  [["updated_at", "2021-02-28 04:21:19.591796"], ["member_id", 6], ["id", 2]]