app/controllers/semesters_controller.rb

  def index
    @semesters = Semester.order("start_date DESC")
---
SELECT "semesters".* FROM "semesters" ORDER BY start_date DESC

  def show
    @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @semester = Semester.find(params[:id])
    @semester.destroy
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "semesters" WHERE "semesters"."id" = $1  [["id", 2]]